<?php
/*
Plugin Name: Aomailer
Plugin URI: https://targetsms.ru/otpravka-sms-iz-wordpress-woocommerce
Author: TargetSMS
Version: 1.0.32
Author URI: https://targetsms.ru/
Description: С помощью плагина "TargetSMS.ru: СМС/Email-рассылки и уведомления" Вы можете отправлять произвольные СМС-рассылки и автоматические СМС и Email-уведомления о статусах заказов администраторам и покупателям интернет-магазина, работающего на платформе WordPress WooCommerce.

<b>Функционал</b>
<ol>
<li>Регистрация Вашего имени отправителя бесплатно;</li>
<li>Автоматическое СМС и Email-уведомление администратора интернет-магазина, работающего на платформе WordPress, о появлении нового заказа;</li>
<li>Автоматическая отправка СМС и Email-сообщений пользователям интернет-магазина при смене статусов заказов;</li>
<li>Поддержка шаблонов СМС и Email-сообщений (например, уведомление о новом заказе, оплате заказа и т.п.);</li>
<li>Персонификация текстов СМС и Email (включая тему письма);</li>
<li>Сохранение (лог) истории отправленных сообщений в карточке заказа;</li>
<li>Подробные статусы доставки СМС и Email-сообщений в истории</li>
<li>Отправка массовых СМС-рассылок</li>
<li>Распознавание номеров телефонов в самых разных форматах, например, 900-123-45-67, 79001234567 и т.п. (РЕКОМЕНДАЦИЯ: заносить номера телефонов в карточки клиентов исключительно в международном формате +79000000001);</li>
<li>Отправка СМС абонентам всего мира (Россия, Украина, Белоруссия, Казахстан и т.п.);</li>
<li>Отправка Email с использованием нашего надежного SMTP-сервера (вместо почтового сервера WordPress);</li>
<li>Автоматическая загрузка используемых имен отправителей из Вашего личного кабинета СМС-рассылок sms.targetsms.ru​.</li>
</ol>

<b>Активация плагина</b>
<ol>
Для активации плагина "TargetSMS.ru: СМС-рассылки и уведомления":
<li>Пройдите регистрацию в нашем сервисе СМС-рассылок. После регистрации Вы получите логин, пароль, тестовое имя отправителя и бесплатный тестовый баланс для проверки работы сервиса СМС-рассылок;</li>
<li>Установите плагин "TargetSMS.ru: СМС-рассылки и уведомления" с помощью стандартной процедуры в панели администрирования WordPress.</li>
</ol>

<b>Настройки плагина</b>
<ol>
<li>Во вкладке "Настройки" в полях «Логин» и «Пароль» ввести логин и пароль от Вашего личного кабинета sms.targetsms.ru (эти данные предоставим Вам мы) и нажать кнопку "Сохранить" (она находится справа внизу)</li>
<li>После этого в появившемся селекторе выберите нужную подпись имени отправителя и снова нажмите кнопку "Сохранить". Индикатором корректной настройки является актуальный баланс рассылок.</li>
</ol>

<b>Шаблоны СМС администраторам интернет-магазина</b>
<ol>
<li>Зайдите в раздел "События" и выберите, по каким событиям Вы хотите отправлять СМС администраторам интернет-магазина (например, при поступлении нового заказа и оплате заказа)</li>
<li>Зайдите в раздел "Шаблоны" и настройте тексты СМС с использованием, если необходимо, параметров персонификации текста</li>
<li>В поле "Телефон" внесите номер телефона администратора интернет-магазина. В случае необходимости добавить несколько номеров телефонов администраторов, нажмите на знак "плюс" справа внизу от поля "Телефон"</li>
<li>Нажмите кнопку "Сохранить"</li>
</ol>

<b>Шаблоны СМС покупателям интернет-магазина</b>
Настраивается полностью аналогично шаблонам администраторам (см. выше)

Все шаблоны можно увидеть, переключая тип уведомлений (например, если выберете тип уведомлений "Новый заказ", то увидите соответствующий ему сохраненный шаблон текста СМС).

<b>Параметры персонификации текста СМС</b>
Поддерживаются следующие параметры персонификации текста СМС:
<ul>
<li>#Название (Магазин)#</li>
<li>#ID (Заказ)#</li>
<li>#Сумма (Заказ)#</li>
<li>#Имя (Контакт)#</li>
<li>#Фамилия (Контакт)#</li>
<li>#Статус (Заказ)#</li>
<li>#Адрес доставки (Заказ)#</li>
<li>#Адрес оплаты (Заказ)#</li>
<li>#Метод оплаты (Заказ)#</li>
<li>#Email (Заказ)#</li>
<li>#Номер телефона (Заказ)#</li>
</ul>

<b>Отправка произвольных СМС-рассылок</b>
<ol>
1. Для отправки одиночного СМС-сообщения пройдите в вкладку "Рассылки"
2. Заполните открывшуюся форму рассылки и нажмите на кнопку "Отправить"
</ol>

<b>Отправка Email c использованием нашего SMTP-сервера (вместо почтового сервера WordPress)</b>
В плагине WooCommerce есть встроенная отправка Email-сообщений, которая осуществляется с использованием почтового сервера WooCommerce. Вместо этого встроенного стандартного почтового сервера Вы можете настроить отправку электронных писем через нашу мощную и функциональную платформу. Для этого:
<ol>
<li>Кликните на "Настройки Email"</li>
<li>Заполните открывшуюся форму, поставив переключатель в положение "Использовать" указав "Email отправителя", "Подпись отправителя", "Ответить на Email", "Ответить на имя"</li>
<li>Нажмите на кнопку "Сохранить".</li>
</ol>

Далее необходимо настроить нужные Вам Email-уведомления:
<ol>
<li>Откройте "WooCommerce" - "Настройки"</li>
<li>Откройте вкладку "Email'ы"</li>
<li>осуществите нужные Вам настройки писем администраторам или покупателям, а также общие настройки шаблона Email.</li>
</ol>

<b>Проверка истории</b>
Для проверки истории отправки уведомлений, пройдите в меню "История"

<b>Проверка баланса</b>
Для проверки баланса пройдите в вкладку "Настройки". При необходимости можно перейти в личный кабинет сервиса СМС-рассылок sms.targetsms.ru или пополнить баланс, нажав на кнопку "Пополнить баланс".

Подробная инструкция по установке и настройке: <a href="https://targetsms.ru/otpravka-sms-iz-wordpress-woocommerce">https://targetsms.ru/otpravka-sms-iz-wordpress-woocommerce</a>
*/

define('AOMP_AOMAILER_DIR', plugin_dir_path(__FILE__));
define('AOMP_AOMAILER_URL', plugin_dir_url(__FILE__));
define('AOMP_DEBUG', false);

require_once __DIR__ . '/autoload.php';

load_plugin_textdomain('aomailer', false, dirname(plugin_basename(__FILE__)) . '/lang/');

register_activation_hook(__FILE__, ['AomailerAdmin', 'install']);
register_uninstall_hook(__FILE__, ['AomailerAdmin', 'uninstall']);
register_deactivation_hook(__FILE__, ['AomailerAdmin', 'deactivation']);

function aomp_aomailer_load() {

	if (is_admin()) {
		$is_plugin_page = false;
		if (!empty($_GET['page']) && preg_match('/aomailer/i', $_GET['page'])) {
			$is_plugin_page = true;
		}
		
		AomailerAdmin::aomp($is_plugin_page)->wpAdmin();
	}
		
	AomailerCore::aomp()->listner();
}

if (in_array('woocommerce/woocommerce.php', apply_filters('active_plugins', get_option('active_plugins')))) {
	add_action('plugins_loaded', 'aomp_aomailer_load');
}